# IsValid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Dimension..::..IsValid Property
Dimension Class See Also
---
Indicates if this dimension is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsValid { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsValid As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsValid {
	bool get ();
}
```

# Remarks
This property always returns true for model dimensions. It can return false for view-specific dimensions that are hidden because they are in an invalid state. An example of an invalid state is having misaligned references for an aligned dimension.
# See Also
Dimension Class
Autodesk.Revit.DB Namespace